# Pandas GroupBy

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("DataSets/Employee.csv")
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38.0,Female,No,2,0
3,Masters,2016,Bangalore,3,27.0,Male,No,5,1
4,Masters,2017,Pune,3,24.0,Male,Yes,2,1

In [3]:
grouped = df.groupby("Education")
# print(grouped.size())
# print(grouped.count())
# print(grouped.describe())
# print(grouped.LeaveOrNot.mean())
# print(grouped.Age.max())
# print(grouped.get_group("Masters").min())
print(grouped.City.min())

Education
Bachelors    Bangalore
Masters      Bangalore
PHD          Bangalore
Name: City, dtype: object

In [9]:
grouped = df.groupby("City")

In [10]:
for grouped_name, grouped_df in grouped:
    print(grouped_name)
    print(grouped_df)

Bangalore
      Education  JoiningYear       City  PaymentTier   Age  Gender  \
0     Bachelors         2017  Bangalore            3  34.0    Male
3       Masters         2016  Bangalore            3  27.0    Male
5     Bachelors         2016  Bangalore            3  22.0    Male
7     Bachelors         2016  Bangalore            3  34.0  Female
10      Masters         2012  Bangalore            3  27.0    Male
...         ...          ...        ...          ...   ...     ...
4643  Bachelors         2013  Bangalore            3  31.0  Female
4646  Bachelors         2013  Bangalore            3  25.0  Female
4648  Bachelors         2013  Bangalore            3  26.0  Female
4651  Bachelors         2012  Bangalore            3  30.0    Male
4652  Bachelors         2015  Bangalore            3  33.0    Male

     EverBenched  ExperienceInCurrentDomain  LeaveOrNot
0             No                          0           0
3             No                          5           1
5             No                          0           0
7             No                          2           1
10            No                          5           1
...          ...                        ...         ...
4643          No                          5           0
4646          No                          3           0
4648          No                          4           0
4651         Yes                          2           0
4652         Yes                          4           0

[2228 rows x 9 columns]
New Delhi
      Education  JoiningYear       City  PaymentTier   Age  Gender  \
2     Bachelors         2014  New Delhi            3  38.0  Female
6     Bachelors         2015  New Delhi            3  38.0    Male
9       Masters         2017  New Delhi            2  37.0    Male
19    Bachelors         2016  New Delhi            2  22.0  Female
21      Masters         2017  New Delhi            2  28.0    Male
...         ...          ...        ...          ...   ...     ...
4616    Masters         2015  New Delhi            3  40.0  Female
4618    Masters         2017  New Delhi            3  38.0  Female
4634  Bachelors         2016  New Delhi            1  38.0  Female
4636    Masters         2014  New Delhi            3  37.0  Female
4650    Masters         2018  New Delhi            3  27.0    Male

     EverBenched  ExperienceInCurrentDomain  LeaveOrNot
2             No                          2           0
6             No                          0           0
9             No                          2           0
19            No                          0           1
21            No                          4           0
...          ...                        ...         ...
4616          No                          5           0
4618          No                          2           1
4634          No                          2           1
4636          No                          0           1
4650          No                          5           1

[1157 rows x 9 columns]
Pune
      Education  JoiningYear  City  PaymentTier   Age  Gender EverBenched  \
1     Bachelors         2013  Pune            1  28.0  Female          No
4       Masters         2017  Pune            3  24.0    Male         Yes
8     Bachelors         2016  Pune            3  23.0    Male          No
11    Bachelors         2016  Pune            3  34.0    Male          No
12    Bachelors         2018  Pune            3  32.0    Male         Yes
...         ...          ...   ...          ...   ...     ...         ...
4630  Bachelors         2012  Pune            3  25.0  Female          No
4644  Bachelors         2015  Pune            3  32.0  Female         Yes
4645    Masters         2017  Pune            2  31.0  Female          No
4647  Bachelors         2016  Pune            3  30.0    Male          No
4649    Masters         2013  Pune            2  37.0    Male          No

      ExperienceInCurrentDomain  LeaveOrNot
1                             3           1
4                             2           1
8                             1           0
11                            3           0
12                            5           1
...                         ...         ...
4630                          3           1
4644                          1           1
4645                          2           0
4647                          2           0
4649                          2           1

[1268 rows x 9 columns]

In [11]:
print(grouped.get_group("Pune"))

      Education  JoiningYear  City  PaymentTier   Age  Gender EverBenched  \
1     Bachelors         2013  Pune            1  28.0  Female          No
4       Masters         2017  Pune            3  24.0    Male         Yes
8     Bachelors         2016  Pune            3  23.0    Male          No
11    Bachelors         2016  Pune            3  34.0    Male          No
12    Bachelors         2018  Pune            3  32.0    Male         Yes
...         ...          ...   ...          ...   ...     ...         ...
4630  Bachelors         2012  Pune            3  25.0  Female          No
4644  Bachelors         2015  Pune            3  32.0  Female         Yes
4645    Masters         2017  Pune            2  31.0  Female          No
4647  Bachelors         2016  Pune            3  30.0    Male          No
4649    Masters         2013  Pune            2  37.0    Male          No

      ExperienceInCurrentDomain  LeaveOrNot
1                             3           1
4                             2           1
8                             1           0
11                            3           0
12                            5           1
...                         ...         ...
4630                          3           1
4644                          1           1
4645                          2           0
4647                          2           0
4649                          2           1

[1268 rows x 9 columns]

In [17]:
grouped.describe()

          JoiningYear                                                         \
                count         mean       std     min     25%     50%     75%
City
Bangalore      2228.0  2014.859515  1.899711  2012.0  2013.0  2015.0  2017.0
New Delhi      1157.0  2015.522040  1.862182  2012.0  2014.0  2016.0  2017.0
Pune           1268.0  2015.001577  1.724057  2012.0  2014.0  2015.0  2017.0

                  PaymentTier            ... ExperienceInCurrentDomain       \
              max       count      mean  ...                       75%  max
City                                     ...
Bangalore  2018.0      2228.0  2.870287  ...                       4.0  7.0
New Delhi  2018.0      1157.0  2.598099  ...                       4.0  6.0
Pune       2018.0      1268.0  2.487382  ...                       4.0  7.0

          LeaveOrNot
               count      mean       std  min  25%  50%  75%  max
City
Bangalore     2228.0  0.267056  0.442521  0.0  0.0  0.0  1.0  1.0
New Delhi     1157.0  0.316335  0.465247  0.0  0.0  0.0  1.0  1.0
Pune          1268.0  0.503943  0.500182  0.0  0.0  1.0  1.0  1.0

[3 rows x 40 columns]